<!-- saved from url=(0022)http://internet.e-mail -->
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>index_fr</TITLE>
<META NAME="ProgId" CONTENT="FrontPage.Editor.Document">
<META NAME="Template" CONTENT="C:\Archivos de programa\Microsoft Office\Office\html.dot">
<META HTTP-EQUIV="Content-Language" CONTENT="es"><STYLE type="text/css"></STYLE></HEAD>
<BODY LINK="#0000ff" VLINK="#800080">

<P><!-- saved from url=(0022)http://internet.e-mail -->h1,h2,h3,h4 { font-family:Arial,Helvetica,sans-serif; } p { color:black;font-family:Arial,Helvetica,sans-serif;font-size:9pt } li { color:black;font-family:Arial,Helvetica,sans-serif;font-size:9pt } <FONT FACE="Arial Alternative,Arial" SIZE=4>hipergate v1.2.1</FONT><BR>
<B><FONT FACE="Arial" SIZE=6>Manuel d'Utilisation</FONT> </P>
<P ALIGN="RIGHT"><A HREF="javascript:window.history.back()">retour</A></P>
<H2>Table des Mati&egrave;res</H2>
<OL>

<LI><A HREF="#configuration">Configuration</A></LI>
<LI><A HREF="#concepts">Concepts G&eacute;n&eacute;raux</A></LI>
<LI><A HREF="#contacts">Gestion de Contacts</A></LI>
<LI><A HREF="#projects">Gestion de Projets</A></LI>
<LI><A HREF="#vdisk">Disque Virtuel</A></LI>
<LI><A HREF="#cms">Production de Contenus</A></LI></OL>

<P>&nbsp; </P>
<HR>
<H1><A NAME="configuration">Configuration</A></H1>
<H2><A NAME="configuration_security">Administration de S&eacute;curit&eacute;</A></H2>
<H3>Domaines</H3>
<H4>Domaine du Syst&egrave;me et Domaine Mod&egrave;le</H4>
<P>Lorsque la base de donn&eacute;es d'hipergate est charg&eacute;e pour la premi&egrave;re fois, deux Domaines indispensables pour le fonctionnement de la suite sont cr&eacute;&eacute;s : le Domaine SYSTEM (1024) et le Domaine MODEL (1025). Ces domaines n'existent qu'&agrave; des fins administratives et ils ne doivent pas &ecirc;tre utilis&eacute;s pour des essais ni pour des t&acirc;ches de programmation.</P>
<P>Le processus de cr&eacute;ation par d&eacute;faut g&eacute;n&egrave;re d'ailleurs 3 autres domaines : TEST, DEMO, REAL, con&ccedil;us pour servir de support rapide au d&eacute;veloppement, aux essais d'acceptation et &agrave; l'exploitation en r&eacute;el de la suite.</P>
<P>Le Domaine SYSTEM sert &agrave; administrer &agrave; pleins pouvoirs les autres domaines. L'utilisateur et la cl&eacute; par d&eacute;faut pour acc&eacute;der &agrave; SYSTEM sont : "administrator@hipergate-system.com" / "hipergate".</P>
<P>Le Domaine MODEL sert de base pour faire des copies cloniques et g&eacute;n&eacute;rer de nouveaux domaines. L'utilisateur et la cl&eacute; par d&eacute;faut pour acc&eacute;der &agrave; MODEL sont : "administrator@hipergate-model.com" / "model".</P>
<P><FONT FACE="Wingdings" SIZE=5>F</FONT> Il est imp&eacute;ratif de changer les cl&eacute;s d'acc&egrave;s par d&eacute;faut &agrave; SYSTEM et MODEL afin d'assurer un minimum de s&eacute;curit&eacute;.</P>
<P><FONT FACE="Wingdings" SIZE=5>F</FONT> Les donn&eacute;es principales du domaine MODEL ne doivent &ecirc;tre modifi&eacute;es en aucune fa&ccedil;on. Sinon, le processus de clonation peut &eacute;chouer et la cr&eacute;ation de nouveaux Domaines et Zones de Travail deviendra impossible.</P>
<H4>Utilisateur et Groupe propri&eacute;taires du Domaine</H4>
<P>Chaque Domaine poss&egrave;de un seul Utilisateur Propri&eacute;taire et Groupe d'Administrateurs &agrave; pleins pouvoirs sur ce Domaine. Cet Utilisateur et ce Groupe sont automatiquement g&eacute;n&eacute;r&eacute;s lors de la cr&eacute;ation du domaine. L'application ne permet de supprimer le Propri&eacute;taire du domaine ni le Groupe d'Administrateurs (quoiqu'il soit possible de changer leur configuration) car, autrement, le Domaine deviendrait impossible &agrave; administrer depuis le front-end HTML.</P>
<H4>Comment cr&eacute;er des Domaines</H4>
<P>Les Domaines d'hipergate ne peuvent &ecirc;tre cr&eacute;&eacute;s qu'&eacute;tant connect&eacute; au Domaine SYSTEM.</P>
<P>Une fois connect&eacute;, il faut choisir l'&eacute;tiquette Configuration et s&eacute;lectionner le radio button Domaines. Ce radio button appara&icirc;t seulement dans le Domaine SYSTEM.</P>
<P>Chaque Domaine poss&egrave;de un identificateur entier unique qui est automatiquement attribu&eacute;, et aussi un nom qui peut &ecirc;tre modifi&eacute; &agrave; tout moment. Les domaines de nouvelle cr&eacute;ation sont num&eacute;rot&eacute;s &agrave; partir de 2048. Tous les domaines de 0 &agrave; 2048 sont r&eacute;serv&eacute;s &agrave; l'usage interne d'hipergate et ne doivent pas &ecirc;tre affect&eacute;s &agrave; des applications d'utilisateur.</P>
<P>Au moment de cr&eacute;er un nouveau Domaine, une Zone de Travail appel&eacute;e "<I>nomdudomaine</I>_default" est automatiquement g&eacute;n&eacute;r&eacute;e. Cette Zone de Travail contient une copie des valeurs de consultation par d&eacute;faut de la Zone de Travail model_default. Pour une explication d&eacute;taill&eacute;e du processus de clonation&nbsp;de domaines / zone de travail, voir la proc&eacute;dure createDomain() de la classe com.knowgate.hipergate.datamodel.ModelManager de la r&eacute;f&eacute;rence de l'API JavaDoc.</P>
<H3><A NAME="configuration_workareas">Zones de Travail</A></H3>
<P>Chaque Domaine peut avoir une ou plusieurs Zones de Travail. Par d&eacute;faut, les domaines TEST, DEMO et REAL sont pr&eacute;charg&eacute;s avec une Zone de Travail. Ces Zones de Travail incorpor&eacute;es contiennent des valeurs dans les tables de consultation pour qu'il soit plus facile de commencer l'exploitation de la suite.</P>
<H4>Comment cr&eacute;er des Zones de Travail</H4>
<P>Connectez-vous &agrave; n'importe quel domaine, sauf SYSTEM ou MODEL (il n'est pas permis de cr&eacute;er des Zones de Travail dans les Domaines du syst&egrave;me afin de sauvegarder l'int&eacute;grit&eacute;). Choisissez l'&eacute;tiquette Configuration et s&eacute;lectionnez le radio button Zones de Travail. L'&eacute;cran de cr&eacute;ation de Zones de Travail sera alors affich&eacute;. Choisissez un nom exclusif pour la Zone de Travail, sans oublier que les noms des Zones de Travail ne peuvent pas &ecirc;tre r&eacute;p&eacute;t&eacute;s dans l'ensemble de la base de donn&eacute;es. M&ecirc;me si deux Zones de Travail appartiennent &agrave; des domaines diff&eacute;rents, elles ne peuvent pas partager un nom identique. Pour autant, vous pouvez nommer la Zone de Travail en utilisant le nom du domaine comme pr&eacute;fixe (par exemple, test_mazone). Pour les noms des Zones il faut employer uniquement des caract&egrave;res ASCII-7.</P>
<H4>Comment attribuer des Utilisateurs &agrave; des Zones de Travail</H4>
<P>Connectez-vous en tant qu'administrateur du domaine, choisissez l'&eacute;tiquette Configuration, et ensuite s&eacute;lectionnez le radio button Utilisateurs. &Eacute;ditez l'utilisateur dont la Zone de Travail par d&eacute;faut vous d&eacute;sirez changer. Changez la Zone de Travail sur la combobox o&ugrave; la liste des Zones de Travail disponibles est affich&eacute;e.</P>
<FONT FACE="Wingdings" SIZE=5><P>F</FONT> On peut attribuer uniquement des Zones de Travail appartenant au m&ecirc;me domaine de l'utilisateur.</P>
<H4>Comment activer et d&eacute;sactiver des modules</H4>
<P>Les modules d'hipergate sont ind&eacute;pendants et peuvent &ecirc;tre utilis&eacute;s s&eacute;par&eacute;ment en faisant dispara&icirc;tre les modules superflus du menu principal. Pour activer ou d&eacute;sactiver un module, connectez-vous, en tant qu'administrateur, au domaine souhait&eacute;. Choisissez l'&eacute;tiquette Configuration, puis s&eacute;lectionnez le radio button Zones de Travail. Cliquez ensuite sur la Zone de Travail souhait&eacute;e et vous verrez la liste des applications install&eacute;es. Pour chaque application, d&eacute;cidez si elle sera ou non visible au menu principal en cochant la checkbox correspondante.&nbsp;</P>
<H3><A NAME="configuration_roles">R&ocirc;les</A></H3>
<P>Une Zone de Travail dispose toujours de 4 r&ocirc;les d'acc&egrave;s : Administrateurs, Utilisateurs Avanc&eacute;s, Utilisateurs, Invit&eacute;s. Pour chaque R&ocirc;le et Zone de Travail, il existe un seul Groupe d'Utilisateurs ayant ce r&ocirc;le.</P>
<H4>Comment attribuer des R&ocirc;les aux Zones de Travail</H4>
<P>Connectez-vous en tant qu'administrateur au domaine souhait&eacute;. Choisissez l'&eacute;tiquette Configuration et s&eacute;lectionnez le radio button Zones de Travail. Choisissez la Zone de Travail souhait&eacute;e et la liste des applications install&eacute;es sera affich&eacute;e. Pour chaque application, d&eacute;cidez si elle sera ou non visible au menu principal en cochant la checkbox correspondante. Attribuez des r&ocirc;les pour chaque application active en utilisant ses combo boxes.</P>
<H4>Le r&ocirc;le d'Administrateur</H4>
<P>Les administrateurs d'une Zone de Travail b&eacute;n&eacute;ficient de certains privil&egrave;ges qui peuvent varier d'une application &agrave; l'autre. En particulier, et ceci pour toutes les applications standard, seuls les administrateurs peuvent :</P>

<UL>
<LI>Ajouter ou &eacute;liminer des valeurs de consultation. </LI>
<LI>Ajouter ou &eacute;liminer des champs d&eacute;finis par l'utilisateur.&nbsp; </LI></UL>

<H4>Le r&ocirc;le d'Invit&eacute; (acc&egrave;s &agrave; la lecture)</H4>
<P>Le Groupe d'Utilisateurs consid&eacute;r&eacute;s comme invit&eacute;s dans une application ne peuvent y acc&eacute;der qu'en lecture, toute modification sur la base de donn&eacute;es leur &eacute;tant interdite.</P>
<H3><A NAME="configuration_users">Utilisateurs</A></H3>
<P>On peut cr&eacute;er un nombre illimit&eacute; d'utilisateurs pour chaque domaine. Chaque utilisateur est affect&eacute; &agrave; une certaine Zone de Travail. Normalement, l'utilisateur ne voit que l'information de sa Zone de Travail. Le processus de connexion standard envoie l'utilisateur &agrave; sa zone de travail pr&eacute;d&eacute;finie. Mais il est possible d'&eacute;crire d'autres protocoles de connexion qui permettent aux utilisateurs de se connecter &agrave; n'importe quelle Zone de Travail.</P>
<H4>Cat&eacute;gorie home de l'utilisateur</H4>
<P>Pour chaque nouvel utilisateur, une <A HREF="#category">Cat&eacute;gorie</A> home est automatiquement g&eacute;n&eacute;r&eacute;e, destin&eacute;e &agrave; stocker les fichiers personnels et d'autres objets de l'utilisateur.</P>
<H3><A NAME="configuration_groups">Groupes</A></H3>
<P>Chaque domaine peut contenir un nombre illimit&eacute; de Groupes d'Utilisateurs. Le nombre total de permis d'acc&egrave;s d'un utilisateur est le r&eacute;sultat de tous les groupes auxquels il appartient.</P>
<P><HR></P>
<H1><A NAME="concepts">Concepts G&eacute;n&eacute;raux</A></H1>
<H2>Isolement de donn&eacute;es dans les Domaines et Zones de Travail</H2>
<P>hipergate est une suite d'applications multi-entit&eacute;. L'information est stock&eacute;e de telle mani&egrave;re qu'il est possible d'employer la m&ecirc;me base de donn&eacute;es pour garder l'information de plusieurs clients diff&eacute;rents sans que les donn&eacute;es interf&egrave;rent les unes avec les autres.</P>
<P>Grosso modo, les Domaines repr&eacute;sentent des soci&eacute;t&eacute;s (ou d'autres types d'organisations), tandis que les Zones de Travail repr&eacute;sentent des d&eacute;partements au sein des soci&eacute;t&eacute;s.</P>
<P>&Agrave; un moment donn&eacute;, chaque utilisateur est connect&eacute; &agrave; une Zone de Travail sp&eacute;cifique et il ne voit que l'information propre &agrave; cette Zone.</P>
<H2>Valeurs de consultation</H2>
<P>La suite hipergate emploie un syst&egrave;me standard pour s&eacute;lectionner des valeurs de consultation dans l'ensemble des &eacute;crans. Pour chaque table base (soci&eacute;t&eacute;s, contacts, projets, t&acirc;ches, etc.), hipergate g&egrave;re en interne une autre table contenant toutes les valeurs de consultation pour tous les champs de la table base.</P>
<P>Chaque valeur de consultation a une valeur interne (ou un code) ainsi qu'une &eacute;tiquette traduite pour chaque langue support&eacute;e.</P>
<P>Les valeurs de consultation doivent &ecirc;tre des valeurs-cha&icirc;ne. On peut ins&eacute;rer des valeurs num&eacute;riques ou des dates dans les champs de recherche, mais elles sont en tout cas stock&eacute;es comme des s&eacute;ries de caract&egrave;res.</P>
<H2>Requ&ecirc;tes</H2>
<P>Voici une autre fonctionnalit&eacute; commune &agrave; tous les modules : les requ&ecirc;tes. Elles sont accessibles depuis le sous-menu situ&eacute; dans le coin sup&eacute;rieur droit de l'&eacute;cran. Les requ&ecirc;tes disponibles peuvent varier en fonction des modules de l'application qui soient activ&eacute;s. Les requ&ecirc;tes repr&eacute;sentent une proc&eacute;dure simple, quoique limit&eacute;e, de r&eacute;cup&eacute;rer l'information de la base de donn&eacute;es.</P>
<P>Par simplicit&eacute;, chaque requ&ecirc;te peut r&eacute;cup&eacute;rer seulement des donn&eacute;es contenues dans une certaine table ou vue. D'ailleurs, l'interface utilisateur n'admet que 3 crit&egrave;res de recherche par requ&ecirc;te.</P>
<P>&Agrave; l'installation du produit standard, il y a des vues complexes de la base de donn&eacute;es qui permettent d'effectuer directement les requ&ecirc;tes les plus courantes. On peut cr&eacute;er aussi de nouvelles requ&ecirc;tes.&nbsp;</P>
<HR>
<H1><A NAME="contacts">Gestion de Contacts</A></H1>
<P>hipergate offre un syst&egrave;me tr&egrave;s complet de gestion de la relation client&egrave;le, qui comprend la base de donn&eacute;es contacts, la gestion des opportunit&eacute;s de vente et la maintenance des listes de distribution.</P>
<H2>Soci&eacute;t&eacute;s</H2>
<P>Les Soci&eacute;t&eacute;s peuvent repr&eacute;senter des clients aussi bien que des fournisseurs, concurrents, partenaires, etc.</P>
<P>Chaque soci&eacute;t&eacute; contient une panoplie d'Adresses et de Contacts. Ces contacts peuvent, &agrave; leur tour, avoir leurs propres adresses, de sorte que vous devez d&eacute;cider, au moment de remplir la base de donn&eacute;es, si les adresses postales seront affect&eacute;es aux Soci&eacute;t&eacute;s, aux Contacts ou aux deux.</P>
<P><FONT FACE="Wingdings" SIZE=5>F</FONT> Il est recommand&eacute; d'employer seulement des lettres majuscules pour les noms de soci&eacute;t&eacute;s, individus et adresses. Cela facilitera plus tard la recherche et la r&eacute;cup&eacute;ration de l'information d'une fa&ccedil;on homog&egrave;ne.</P>
<H4>Comment ajouter des adresses</H4>
<P>Vous ne pouvez pas ajouter les adresses &agrave; une soci&eacute;t&eacute; jusqu'&agrave; ce que celle-ci ne soit pas sauv&eacute;e pour la premi&egrave;re fois. Une fois sauv&eacute;e, vous pouvez y ajouter les adresses depuis l'ic&ocirc;ne figurant dans la partie sup&eacute;rieure gauche de l'&eacute;cran, ou bien en cliquant avec le bouton droit de la souris sur le nom de la soci&eacute;t&eacute;.</P>
<H4>Comment ajouter des comptes bancaires</H4>
<P>Vous ne pouvez pas ajouter les comptes bancaires &agrave; une soci&eacute;t&eacute; jusqu'&agrave; ce que celle-ci ne soit pas sauv&eacute;e pour la premi&egrave;re fois. Une fois sauv&eacute;e, vous pouvez y ajouter les comptes bancaires depuis l'ic&ocirc;ne "portefeuille" situ&eacute;e dans la partie sup&eacute;rieure du formulaire.</P>
<H4>Comment dupliquer des soci&eacute;t&eacute;s</H4>
<P>Dans la liste des soci&eacute;t&eacute;s, cliquez &agrave; l'aide du bouton droit de la souris sur la raison sociale, puis choisissez l'option Dupliquer. Au moment de dupliquer une soci&eacute;t&eacute;, ses adresses sont &eacute;galement dupliqu&eacute;es.</P>
<H4>Comment cat&eacute;goriser des soci&eacute;t&eacute;s</H4>
<P>&Agrave; condition que l'application R&eacute;pertoire soit activ&eacute;e, vous pouvez attribuer les soci&eacute;t&eacute;s &agrave; des cat&eacute;gories cr&eacute;&eacute;es depuis l'application Disque Virtuel / Biblioth&egrave;que d'Entreprise. En utilisant les adresses de chaque soci&eacute;t&eacute;, cette cat&eacute;gorisation peut servir &agrave; cr&eacute;er des r&eacute;pertoires hi&eacute;rarchiques d'adresses et des liens.</P>
<H4>Comment classer des soci&eacute;t&eacute;s selon les familles de produits qu'elles ach&egrave;tent</H4>
<P>&Agrave; condition que l'application Magasin Virtuel soit activ&eacute;e, vous pouvez classer les soci&eacute;t&eacute;s suivant les cat&eacute;gories de produits qu'elles ach&egrave;tent.</P>
<H2>Individus</H2>
<P>Les contacts individuels peuvent &ecirc;tre cr&eacute;&eacute;s d'une mani&egrave;re ind&eacute;pendante ou attribu&eacute;s &agrave; une soci&eacute;t&eacute;. Un contact peut avoir ses propres adresses ou h&eacute;riter celles de la soci&eacute;t&eacute; &agrave; laquelle il appartient, or il est recommand&eacute; d'utiliser une adresse ind&eacute;pendante pour chaque contact car cela facilite l'exploitation des donn&eacute;es a posteriori.</P>
<H4>Comment adjoindre des notes</H4>
<P>Dans la liste des individus, cliquez avec le bouton droit de la souris sur le nom, puis s&eacute;lectionnez l'option Ajouter Note.</P>
<H4>Comment adjoindre des fichiers</H4>
<P>Dans la liste des individus, cliquez avec le bouton droit de la souris sur le nom, puis s&eacute;lectionnez l'option Adjoindre Fichier.</P>
<H4>Comment dupliquer des individus</H4>
<P>Dans la liste des individus, cliquez avec le bouton droit de la souris sur le nom, puis s&eacute;lectionnez l'option Dupliquer. Lorsqu'on duplique un individu, ses adresses associ&eacute;es sont &eacute;galement dupliqu&eacute;es, mais non ses opportunit&eacute;s, ses notes ni ses fichiers joints.</P>
<H4>Comment voir les abonnements d'un individu &agrave; toutes les listes de distribution</H4>
<P>Dans le formulaire &Eacute;dition d'individus, cliquez sur l'ic&ocirc;ne Abonnements situ&eacute;e dans la partie sup&eacute;rieure gauche. Toutes les listes disponibles avec l'&eacute;tat d'abonnement &agrave; chacune d'entre elles seront alors affich&eacute;es. Remarquez bien que l'on ne peut ajouter ou &eacute;liminer que les individus figurant dans les listes statiques ou directes.</P>
<H2>Opportunit&eacute;s</H2>
<H4>Comment cr&eacute;er des opportunit&eacute;s</H4>
<P>Les opportunit&eacute;s ne peuvent pas &ecirc;tre cr&eacute;&eacute;es isol&eacute;ment, mais elles doivent &ecirc;tre toujours associ&eacute;es &agrave; un contact individuel. Pour cr&eacute;er une opportunit&eacute;, allez &agrave; la liste des contacts, cliquez &agrave; l'aide du bouton droit de la souris sur le lien d'un contact, et ensuite s&eacute;lectionnez l'option Cr&eacute;er Opportunit&eacute; dans le menu contextuel.</P>
<H4>Opportunit&eacute;s publiques et priv&eacute;es</H4>
<P>Les opportunit&eacute;s peuvent &ecirc;tre visibles pour tous les utilisateurs de la zone de travail (opportunit&eacute;s publiques) ou seulement pour l'utilisateur qui les a cr&eacute;&eacute;es (opportunit&eacute;s priv&eacute;es).</P>
<H2>Listes de Distribution</H2>
<P>La liste de distribution est un ensemble arbitraire de Soci&eacute;t&eacute;s ou d'Individus. Vous pouvez avoir autant de listes diff&eacute;rentes que vous le souhaitez.</P>
<P>Il y a trois types de listes de distribution :</P>
<OL>

<B><LI>Listes Dynamiques</LI>
<LI>Listes Statiques</LI>
<LI>Listes Directes</LI></OL>

<H4>Listes Dynamiques</H4>
<P>Les listes dynamiques se basent sur des requ&ecirc;tes sur la table Individus. Les membres d'une liste de ce type sont extraits de la table Individus &agrave; chaque fois que la liste est appel&eacute;e. Par cons&eacute;quent, les membres d'une liste dynamique varient avec le temps au fur et &agrave; mesure que change la table Individus. Il n'est possible d'ajouter ni de supprimer des membres d'une liste dynamique, mais on peut les ajouter &agrave; la liste noire associ&eacute;e, comme nous l'expliquons plus loin.</P>
<P>Les listes dynamiques sont utiles lorsqu'il faut faire des envois r&eacute;currents o&ugrave; il n'est pas n&eacute;cessaire de garder un historique des destinataires de chaque envoi.</P>
<H4>Listes Statiques</H4>
<P>De m&ecirc;me que les listes dynamiques, les listes statiques sont bas&eacute;es sur des requ&ecirc;tes pr&eacute;d&eacute;finies. La diff&eacute;rence r&eacute;side en ce que les membres d'une liste statique sont d&eacute;finis une fois et puis stock&eacute;s s&eacute;par&eacute;ment des tables Individus et Soci&eacute;t&eacute;s. C'est pourquoi les membres d'une liste statique demeurent inalt&eacute;r&eacute;s m&ecirc;me si l'on modifie la table Individus ou la table Soci&eacute;t&eacute;s.</P>
<P>Parmi toutes les donn&eacute;es concernant une Soci&eacute;t&eacute; ou un Individu, seulement son nom, e-mail et salutation sont m&eacute;moris&eacute;s avec la liste. Les autres donn&eacute;es qui peuvent &ecirc;tre n&eacute;cessaires –adresse postale, fax, etc.– sont toujours r&eacute;cup&eacute;r&eacute;es dynamiquement des tables base &agrave; chaque fois que l'on utilise la liste.</P>
<P>Les listes statiques sont utiles lorsqu'il faut faire un envoi et garder la liste de tous les destinataires contact&eacute;s.</P>
<H4>Listes Directes</H4>
<P>Pour cr&eacute;er une liste directe, il faut charger les donn&eacute;es directement depuis un fichier texte. Tandis que les membres des listes dynamiques ou statiques sont toujours des Contacts ou des Soci&eacute;t&eacute;s g&eacute;r&eacute;s par l'application, les membres d'une liste directe n'ont rien &agrave; voir avec les Contacts ou les Soci&eacute;t&eacute;s. C'est-&agrave;-dire, il n'est pas n&eacute;cessaire de cr&eacute;er un Contact avec toutes ses donn&eacute;es pour &ecirc;tre en &eacute;tat de lui envoyer un e-mail, mais il peut &ecirc;tre directement ajout&eacute; &agrave; une liste directe.</P>
<P>Les seules donn&eacute;es que l'on peut charger pour les membres des listes directes sont l'adresse &eacute;lectronique, le nom et le pr&eacute;nom, et la salutation.</P>
<P>Les fichiers employ&eacute;s pour charger des listes directes doivent avoir un format sp&eacute;cifique. Chaque ligne doit avoir entre 1 et 4 champs.</P>
<H4>Listes Noires</H4>
<P>Chaque liste dynamique, statique ou directe a toujours une autre liste associ&eacute;e, appel&eacute;e liste noire ou liste d'utilisateurs bloqu&eacute;s. Les listes noires ne sont jamais &eacute;dit&eacute;es directement, mais elles sont toujours associ&eacute;es &agrave; une liste blanche. Au moment de lancer les recherches pour les envois, les membres de la liste blanche figurant aussi dans la liste noire correspondante seront &eacute;limin&eacute;s avant de les traiter.</P>
<H4>Comment cr&eacute;er une liste dynamique ou statique</H4>
<OL>

<LI>Acc&eacute;dez &agrave; Gestion de Contacts&nbsp;<FONT FACE="Wingdings">&agrave;</FONT>&nbsp;Listes.</LI>
<LI>Cliquez sur le lien <U>Nouvelle</U>, et il appara&icirc;tra l'Assistant Cr&eacute;ation de Listes.</LI>
<LI>Choisissez le type de liste – Statique ou Dynamique.</LI>
<LI>Passez &agrave; l'&eacute;cran suivant et choisissez la requ&ecirc;te base pour cette liste. S'il n'y a pas de requ&ecirc;te id&eacute;ale, on peut la cr&eacute;er depuis le lien Cr&eacute;er Nouvelle Requ&ecirc;te. Apr&egrave;s avoir cr&eacute;&eacute; la requ&ecirc;te, retournez &agrave; l'Assistant, puis s&eacute;lectionnez-la.</LI>
<LI>Dans l'&eacute;cran suivant, pr&eacute;cisez l'adresse &eacute;lectronique de l'exp&eacute;diteur, le nom qui appara&icirc;tra dans la bo&icirc;te de r&eacute;ception des destinataires, et l'adresse &eacute;lectronique de retour.</LI>
<LI>Enfin, sp&eacute;cifiez un Sujet pour les mails et une Description pour la liste de distribution.</LI></OL>

<H4>Comment cr&eacute;er une liste directe</H4>
<P>Pour cr&eacute;er une liste directe, il faut charger un fichier texte d&eacute;limit&eacute;. Le fichier charg&eacute; doit contenir au moins une colonne avec l'adresse &eacute;lectronique du destinataire, car cette adresse sera employ&eacute;e comme crit&egrave;re primaire. Ce fichier peut contenir 3 autres colonnes avec le pr&eacute;nom, le nom et la salutation dans un ordre quelconque. Les colonnes doivent &ecirc;tre s&eacute;par&eacute;es par des virgules ou par des points-virgules, chaque membre devant figurer dans une ligne diff&eacute;rente.</P>
<OL>

<LI>Acc&eacute;dez &agrave; Gestion de Contacts&nbsp;<FONT FACE="Wingdings">&agrave;</FONT>&nbsp;Listes.</LI>
<LI>Cliquez sur le lien <U>Nouvelle</U>, et il appara&icirc;tra l'Assistant Cr&eacute;ation de Listes.</LI>
<LI>Choisissez le type de liste Directe.</LI>
<LI>Passez &agrave; l'&eacute;cran suivant et pr&eacute;cisez-y le caract&egrave;re s&eacute;parateur et l'ordre des colonnes dans le fichier texte.</LI>
<LI>Dans l'&eacute;cran suivant, pr&eacute;cisez l'adresse &eacute;lectronique de l'exp&eacute;diteur, le nom qui appara&icirc;tra dans la bo&icirc;te de r&eacute;ception des destinataires, et l'adresse &eacute;lectronique de retour.</LI>
<LI>Enfin, sp&eacute;cifiez un Sujet pour les mails et une Description pour la liste de distribution.</LI></OL>

<H4>Les &eacute;tats possibles d'un membre d'une liste</H4>
<P>Voici les trois &eacute;tats possibles de chaque membre d'une liste :</P>
<OL>

<LI><B>Activ&eacute;</B>. Ce membre appartient &agrave; la liste et peut recevoir des mails.</LI>
<LI><B>D&eacute;sactiv&eacute;</B>. Ce membre appartient &agrave; la liste, mais pour une raison ou pour une autre il a &eacute;t&eacute; d&eacute;sactiv&eacute; (par exemple parce que son e-mail n'arrive pas &agrave;<FONT COLOR="#808000"> </FONT>recevoir des messages).</LI>
<LI><B>Bloqu&eacute;</B>. Ce membre appartient &agrave; la liste et son adresse &eacute;lectronique est valide, mais il a express&eacute;ment demand&eacute; qu'on ne lui envoie aucun message.</LI></OL>

<HR>
<H1><A NAME="projects">Gestion de Projets</A></H1>
<H2>Projets</H2>
<P>Le Projet est l'entit&eacute; de base pour la gestion des t&acirc;ches et des incidences sur hipergate. Les projets peuvent exister d'une fa&ccedil;on autonome dans une Zone de Travail ou &ecirc;tre attach&eacute;s &agrave; une Soci&eacute;t&eacute; ou un Individu. Un Projet peut repr&eacute;senter la notion classique d'un ensemble s&eacute;quentiel de t&acirc;ches &agrave; accomplir, mais il peut repr&eacute;senter aussi d'autres choses, telles qu'un contrat d'assistance avec un client ou un travail &agrave; dur&eacute;e ind&eacute;termin&eacute;e de d&eacute;veloppement continu.</P>
<H4>Liste vs. Arbre des Projets</H4>
<P>On peut survoler les projets soit par la liste conventionnelle, soit au moyen de l'Arbre des Projets. &Eacute;tant donn&eacute; que les projets s'organisent hi&eacute;rarchiquement en projets et sous-projets, il est souvent utile d'avoir une interface qui refl&egrave;te cette structure.</P>
<H4>Comment cr&eacute;er un projet</H4>
<P>Les projets sont hi&eacute;rarchiques et ils peuvent &ecirc;tre log&eacute;s les uns dans les autres.</P>
<P>Pour cr&eacute;er un projet, s&eacute;lectionnez l'&eacute;tiquette Projets, puis cliquez sur le lien <U>Nouveau</U>. Le formulaire cr&eacute;ation de projets sera alors affich&eacute;. &Agrave; gauche il y a une liste hi&eacute;rarchique de tous les projets disponibles, et &agrave; droite vous verrez les donn&eacute;es de base du projet &agrave; cr&eacute;er. Vous devez s&eacute;lectionner un projet parent &agrave; gauche, puis introduire le nom du nouveau projet, et ensuite cliquer sur Sauver. Si aucun projet parent n'est sp&eacute;cifi&eacute;, un projet racine sera cr&eacute;&eacute;.</P>
<H4>Comment changer le parent d'un projet</H4>
<OL>

<LI>Acc&eacute;dez &agrave; Gestion de projets&nbsp;<FONT FACE="Wingdings">&agrave;</FONT>&nbsp;Projets.</LI>
<LI>Cliquez sur le lien <U>Arbre</U>.</LI>
<LI>Vous verrez alors l'arbre de tous les projets et sous-projets de la zone de travail actuelle.</LI>
<LI>S&eacute;lectionnez dans l'arbre le projet souhait&eacute;.</LI>
<LI>Dans la combo-box qui appara&icirc;tra &agrave; droite, s&eacute;lectionnez le nouveau parent et cliquez sur Sauver.</LI></OL>

<H4>Comment attribuer un projet &agrave; un client</H4>
<P>&Agrave; condition que le module Gestion de contacts soit activ&eacute;, les valeurs de consultation pertinentes seront affich&eacute;es sur le formulaire Nouveau Projet, afin d'attribuer ce projet &agrave; une Soci&eacute;t&eacute; et &agrave; un Contact sp&eacute;cifiques.</P>
<H2>T&acirc;ches</H2>
<P>Les t&acirc;ches sont toujours associ&eacute;es &agrave; un projet ou sous-projet.</P>
<H4>Comment affecter des co&ucirc;ts &agrave; un projet ou sous-projet</H4>
<P>Cr&eacute;ez une t&acirc;che associ&eacute;e au projet ou sous-projet. Affectez un co&ucirc;t &agrave; cette t&acirc;che, puis sauvez-la.</P>
<H4>Comment attribuer des ressources &agrave; un projet</H4>
<P>Les ressources doivent &ecirc;tre attribu&eacute;es aux t&acirc;ches des projets et non pas aux projets directement.</P>
<P>Les ressources attribuables aux projets ne sont attach&eacute;es en aucune fa&ccedil;on aux listes d'utilisateurs, employ&eacute;s ni contacts standard d'hipergate.</P>
<P>L'attribution des ressources aux t&acirc;ches est purement d&eacute;clarative ; il n'y a point de contr&ocirc;le de chevauchement ou de surattribution.</P>
<H2>Incidences</H2>
<P>Les incidences, de m&ecirc;me que les t&acirc;ches, doivent &ecirc;tre attribu&eacute;es &agrave; un projet. De cette fa&ccedil;on, on peut attacher indirectement une incidence &agrave; un client, en attribuant l'incidence &agrave; un projet, et ce projet &agrave; un client.</P>
<P><HR></P>
<H1><A NAME="vdisk">Disque Virtuel</A></H1>
<H3>R&eacute;pertoire</H3>
<P>Les cat&eacute;gories sont l'&eacute;quivalent, dans le disque virtuel, des r&eacute;pertoires classiques du syst&egrave;me d'exploitation. La diff&eacute;rence r&eacute;side en ce que, dans le cas pr&eacute;sent, les cat&eacute;gories sont des conteneurs g&eacute;n&eacute;riques pouvant contenir d'autres objets en dehors des fichiers. Les cat&eacute;gories se caract&eacute;risent aussi parce qu'elles admettent des &eacute;tiquettes traduites en diff&eacute;rentes langues ; cela signifie que chaque cat&eacute;gorie peut afficher des noms diff&eacute;rents selon la langue choisie, ce qui permet de cr&eacute;er ais&eacute;ment des r&eacute;pertoires hi&eacute;rarchiques multilingues.</P>
<P>Depuis le disque virtuel, les cat&eacute;gories comprennent deux types d'objets : des documents et des liens.</P>
<H4>Comment survoler les cat&eacute;gories</H4>
<P>L'exploration des cat&eacute;gories peut s'effectuer de deux mani&egrave;res, &agrave; savoir : depuis l'arbre situ&eacute; &agrave; gauche ou en cliquant sur les liens affich&eacute;s dans la partie droite de la page. Ces deux types d'exploration sont &eacute;quivalents, mais l'arbre &agrave; gauche n'est pas automatiquement mis &agrave; jour lorsqu'on utilise l'autre type d'exploration.</P>
<P>L'arbre des cat&eacute;gories peut &ecirc;tre &eacute;norme. Il a un seul nœud racine o&ugrave; sont plac&eacute;es toutes les cat&eacute;gories de l'ensemble des zones de travail. Cependant, chaque utilisateur ne voit par d&eacute;faut que ses cat&eacute;gories personnelles, ainsi que les branches de cat&eacute;gories partag&eacute;es pour son domaine et zone de travail.</P>
<H4>Comment visualiser toutes les cat&eacute;gories</H4>
<P>Connectez-vous en tant qu'administrateur au domaine SYSTEM, et allez &agrave; la Biblioth&egrave;que d'Entreprise. L'application reconna&icirc;t le domaine SYSTEM comme un domaine sp&eacute;cial, et donc elle affiche au moment d'entrer toutes les cat&eacute;gories de l'ensemble des domaines, au lieu d'afficher uniquement les cat&eacute;gories personnelles de l'utilisateur connect&eacute;, comme c'est le cas dans les autres domaines. En outre, le domaine SYSTEM affiche dans l'arbre les noms internes des cat&eacute;gories au lieu de ses &eacute;tiquettes traduites en la langue du navigateur, comme c'est le cas dans le reste des domaines.</P>
<H4>Comment cr&eacute;er une nouvelle cat&eacute;gorie</H4>
<OL>

<LI>Acc&eacute;dez &agrave; Biblioth&egrave;que d'Entreprise <FONT FACE="Wingdings">¿</FONT>&nbsp;R&eacute;pertoire.</LI>
<LI>D&eacute;placez-vous dans l'arbre situ&eacute; &agrave; gauche jusqu'&agrave; la cat&eacute;gorie parent, et ensuite cliquez sur le lien Nouvelle.</LI>
<LI>Alternativement, vous pouvez balayer les liens de contenus situ&eacute;s &agrave; droite, puis cliquer sur le lien Nouvelle Cat&eacute;gorie.</LI>
<LI>Le formulaire cr&eacute;ation de cat&eacute;gories sera affich&eacute;.</LI>
<LI>Vous devez alors introduire les &eacute;tiquettes de traduction. Pour ce faire, cliquez sur l'ic&ocirc;ne ayant le symbole&nbsp;<FONT FACE="Symbol">&Aring;</FONT>&nbsp;et, dans la combo-box inf&eacute;rieure gauche, s&eacute;lectionnez la langue souhait&eacute;e pour l'&eacute;tiquette. </LI></OL>

<FONT FACE="Wingdings" SIZE=5><P>F</FONT> Lorsque vous attribuez des &eacute;tiquettes &agrave; une cat&eacute;gorie, vous devez toujours sp&eacute;cifier une &eacute;tiquette pour la langue actuellement prioritaire dans le navigateur Web ; autrement, vous pourriez avoir des difficult&eacute;s &agrave; visualiser la cat&eacute;gorie dans l'arbre.</P>
<H4>Comment supprimer une cat&eacute;gorie</H4>
<P>Les cat&eacute;gories sont &eacute;limin&eacute;es depuis le lien situ&eacute; au-dessus de l'arbre d'exploration. Lors de la suppression d'une cat&eacute;gorie, tous ses objets enfants sont aussi supprim&eacute;s.</P>
<H4>Chercheur de fichiers et de liens</H4>
<P>Pour trouver des sous-cha&icirc;nes &agrave; l'int&eacute;rieur du nom ou de la description d'un document/lien, vous pouvez utiliser la zone de texte situ&eacute;e dans la partie sup&eacute;rieure droite de l'arbre d'exploration de cat&eacute;gories. La cha&icirc;ne recherch&eacute;e prend en compte les casses.</P>
<H3>Pistage des versions d'un document</H3>
<P>La Biblioth&egrave;que d'Entreprise permet de garder un historique des versions pour chaque document. De fait, tous les documents sont versionn&eacute;s en interne m&ecirc;me si aucune version n'est explicitement pr&eacute;cis&eacute;e. Chaque version est identifi&eacute;e par une &eacute;tiquette que l'on attache lors du premier t&eacute;l&eacute;chargement du document. Dans la liste des contenus de chaque cat&eacute;gorie, seule la version du document le plus r&eacute;cemment t&eacute;l&eacute;charg&eacute;e est affich&eacute;e.</P>
<P>&nbsp;</P>
<P><HR></P>
<H1><A NAME="cms">Production de Contenus</A></H1>
<H2>Documents bas&eacute;s sur des mod&egrave;les</H2>
<P>Les documents bas&eacute;s sur des mod&egrave;les (template-based) peuvent &ecirc;tre de 2 types : mono-page (Newsletters et d'autres Documents) ou multi-page (sites Web).</P>
<P>Les mod&egrave;les sont des feuilles de style XSL que l'application incorpore d&eacute;j&agrave; pr&eacute;charg&eacute;es. On ne peut pas cr&eacute;er de nouveaux mod&egrave;les depuis l'application m&ecirc;me, or il existe une m&eacute;thode bien d&eacute;finie pour cr&eacute;er des mod&egrave;les &agrave; partir de fichiers HTML ordinaires.</P>
<H2>Comment cr&eacute;er un nouveau document</H2>
<P>Au moment d'acc&eacute;der au module Production de Contenus, une fiche Documents appara&icirc;t, o&ugrave; il est possible de cr&eacute;er des Newsletters (Nouveau Document) et des Sites Web (Nouveau Site Web).&nbsp;</P>
<P>Cliquez sur l'une des deux options disponibles et vous verrez une fen&ecirc;tre de Cr&eacute;ation en deux &eacute;tapes. Dans la premi&egrave;re fen&ecirc;tre (&Eacute;tape 1), vous devez s&eacute;lectionner le type de document que vous voulez cr&eacute;er (mod&egrave;le), la langue, et facultativement remplir un champ commentaire. Appuyez ensuite sur le bouton Suivant, et le document sera automatiquement cr&eacute;&eacute;.&nbsp;</P>
<P>La fen&ecirc;tre suivante (&Eacute;tape 2) vous offre la possibilit&eacute; de t&eacute;l&eacute;charger dans le serveur Web des fichiers d'images qui seront disponibles plus tard pour &ecirc;tre int&eacute;gr&eacute;s au mod&egrave;le. Lorsque vous aurez s&eacute;lectionn&eacute; les fichiers graphiques souhait&eacute;s, appuyez sur le bouton Terminer.</P>
<P>La fen&ecirc;tre sera alors ferm&eacute;e et vous verrez dans l'&eacute;cran la liste des documents, y compris celui que vous venez de cr&eacute;er. Depuis cette fen&ecirc;tre vous pourrez effectuer plusieurs op&eacute;rations avec ce nouveau document : &eacute;diter, supprimer, voir ses propri&eacute;t&eacute;s, pr&eacute;-visualisation et programmer un envoi (pour les Newsletters).</P>
<H2>&Eacute;dition d'un document</H2>
<H3>&Eacute;dition de Newsletters</H3>
<P>Pour &eacute;diter un document, cliquez &agrave; l'aide du bouton droit de la souris sur le document souhait&eacute; dans l'&eacute;cran Liste de documents, puis choisissez l'option &Eacute;diter. Une nouvelle fen&ecirc;tre sera affich&eacute;e, o&ugrave; vous verrez le document accompagn&eacute; de l'&eacute;cran flottant &Eacute;dition. Depuis ce dernier on peut effectuer les op&eacute;rations suivantes :&nbsp;</P>

<UL>
<LI>Ajouter un nouveau bloc d'information </LI>
<LI>&Eacute;liminer un bloc d'information existant </LI>
<LI>Changer le style </LI>
<LI>&Eacute;diter un bloc d'information </LI></UL>

<H4>Ajouter un nouveau bloc d'information</H4>
<P>Cliquez sur l'option Nouveau dans le Panneau de Contr&ocirc;le. Ceci ouvre une nouvelle fen&ecirc;tre o&ugrave; vous devez sp&eacute;cifier le type de bloc que vous allez &eacute;diter. Une fois s&eacute;lectionn&eacute; le type de bloc d'information que vous voulez ajouter, vous pourrez le modifier dans l'&eacute;cran &Eacute;dition qui sera affich&eacute;.</P>
<H4>&Eacute;liminer des blocs d'information existants</H4>
<P>Dans le Panneau de Contr&ocirc;le, s&eacute;lectionnez les blocs que vous voulez supprimer en cochant les checkboxes correspondantes, puis cliquez sur l'option &Eacute;liminer.</P>
<H4>Changer le style</H4>
<P>L'option Style dans le Panneau de Contr&ocirc;le permet de changer la gamme chromatique et la typographie du document.</P>
<H4>&Eacute;diter un bloc d'information</H4>
<P>Au moment de cr&eacute;er un nouveau bloc d'information ou d'&eacute;diter un bloc existant, la fen&ecirc;tre &Eacute;dition de Bloc d'Information est affich&eacute;e, o&ugrave; l'on peut trouver :</P>

<UL>
<LI><B>Barre de boutons :</B> bouton Sauver (pour m&eacute;moriser les modifications), bouton Restaurer (pour annuler les modifications et remettre le document &agrave; l'&eacute;tat initial, sans quitter l'&eacute;cran &Eacute;dition), bouton Quitter (pour fermer la fen&ecirc;tre &Eacute;dition sans sauvegarder les modifications). </LI>
<LI><B>Zone d'&eacute;dition de textes</B>, qui pr&eacute;sente un formulaire pour &eacute;diter tous les textes du bloc d'information. Pour chaque texte on peut en &eacute;diter les contenus, supprimer les contenus par l'option Vider, attribuer un lien hypertexte dans la zone de texte Lien, ins&eacute;rer des valeurs de champs de base de donn&eacute;es au moyen de la combo-box situ&eacute;e dans la partie inf&eacute;rieure droite de l'&eacute;cran (cette derni&egrave;re option est d'utilit&eacute; pour personnaliser les envois de newsletters programm&eacute;s). </LI>
<LI><B>Zone d'&eacute;dition d'images</B>, o&ugrave; vous pouvez ins&eacute;rer une image du dossier d'images de l'utilisateur, voir l'image actuelle, vider le contenu actuel, &eacute;tablir les dimensions souhait&eacute;es (au cas o&ugrave; vous ne rempliriez pas les champs Hauteur et Largeur, les dimensions r&eacute;elles du fichier d'image seraient prises), attribuer un lien hypertexte dans la zone de texte Lien.&nbsp; </LI></UL>

<FONT FACE="Wingdings" SIZE=5><P>F</FONT>Le cas typique d'utilisation consiste &agrave; &eacute;diter le bloc d'information, compl&eacute;ter les textes, compl&eacute;ter les images et, enfin, appuyer sur le bouton Sauver de la barre de boutons. Apr&egrave;s ces op&eacute;rations, la fen&ecirc;tre &Eacute;dition sera ferm&eacute;e et le document sera r&eacute;g&eacute;n&eacute;r&eacute; pour afficher les modifications.</P>
<H4>Ins&eacute;rer des donn&eacute;es variables (personnalis&eacute;es)</H4>
<P>Dans la newsletter, vous pouvez entrer des valeurs personnalis&eacute;es dans les champs de texte. Ces informations sont prises de la base de donn&eacute;es et remplac&eacute;es lors de chaque envoi programm&eacute; en fonction du destinataire. La table suivante montre les champs insertables et leurs effets :</P>
<TABLE BORDER CELLSPACING=1 WIDTH=620>
<TR><TD WIDTH="20%" VALIGN="MIDDLE">
<B><FONT FACE="Arial" SIZE=2><P>Champ variable</FONT></B></TD>
<TD WIDTH="46%" VALIGN="MIDDLE">
<B><FONT FACE="Arial" SIZE=2><P>Description</FONT></B></TD>
<TD WIDTH="34%" VALIGN="MIDDLE">
<B><FONT FACE="Arial" SIZE=2><P>Effet</FONT></B></TD>
</TR>
<TR><TD WIDTH="20%" VALIGN="MIDDLE">
<FONT FACE="Arial" SIZE=2><P>Pr&eacute;nom</FONT></TD>
<TD WIDTH="46%" VALIGN="MIDDLE">
<FONT FACE="Arial" SIZE=2><P>Pr&eacute;nom du destinataire de la newsletter</FONT></TD>
<TD WIDTH="34%" VALIGN="MIDDLE">
<FONT FACE="Arial" SIZE=2><P>Au moment d'envoyer la newsletter, le code saisi {#Valeur.Pr&eacute;nom} est remplac&eacute; par le pr&eacute;nom du destinataire.</FONT></TD>
</TR>
<TR><TD WIDTH="20%" VALIGN="MIDDLE">
<FONT FACE="Arial" SIZE=2><P>Nom</FONT></TD>
<TD WIDTH="46%" VALIGN="MIDDLE">
<FONT FACE="Arial" SIZE=2><P>Nom du destinataire de la newsletter</FONT></TD>
<TD WIDTH="34%" VALIGN="MIDDLE">
<FONT FACE="Arial" SIZE=2><P>Au moment d'envoyer la newsletter, le code saisi {#Valeur.Nom} est remplac&eacute; par le nom du destinataire.</FONT></TD>
</TR>
<TR><TD WIDTH="20%" VALIGN="MIDDLE">
<FONT FACE="Arial" SIZE=2><P>Courrier &eacute;lectronique</FONT></TD>
<TD WIDTH="46%" VALIGN="MIDDLE">
<FONT FACE="Arial" SIZE=2><P>Adresse &eacute;lectronique du destinataire de la newsletter</FONT></TD>
<TD WIDTH="34%" VALIGN="MIDDLE">
<FONT FACE="Arial" SIZE=2><P>Au moment d'envoyer la newsletter, le code saisi {#Valeur.Email} est remplac&eacute; par l'adresse &eacute;lectronique du destinataire.</FONT></TD>
</TR>
<TR><TD WIDTH="20%" VALIGN="MIDDLE">
<FONT FACE="Arial" SIZE=2><P>Date</FONT></TD>
<TD WIDTH="46%" VALIGN="MIDDLE">
<FONT FACE="Arial" SIZE=2><P>Date actuelle</FONT></TD>
<TD WIDTH="34%" VALIGN="MIDDLE">
<FONT FACE="Arial" SIZE=2><P>Au moment d'envoyer la newsletter, le code saisi {#Valeur.Date} est remplac&eacute; par la date du syst&egrave;me au moment de l'envoi.</FONT></TD>
</TR>
<TR><TD WIDTH="20%" VALIGN="MIDDLE">
<FONT FACE="Arial" SIZE=2><P>Heure</FONT></TD>
<TD WIDTH="46%" VALIGN="MIDDLE">
<FONT FACE="Arial" SIZE=2><P>Heure actuelle</FONT></TD>
<TD WIDTH="34%" VALIGN="MIDDLE">
<FONT FACE="Arial" SIZE=2><P>Au moment d'envoyer la newsletter, le code saisi {#Valeur.Heure} est remplac&eacute; par l'heure du syst&egrave;me au moment de l'envoi.</FONT></TD>
</TR>
</TABLE>

<FONT FACE="Wingdings" SIZE=5><P>F</FONT><FONT FACE="Arial" SIZE=2>Bien que l'&eacute;diteur de blocs d'information permette d'ins&eacute;rer des champs variables tant dans les newsletters que dans les sites Web, cette fonctionnalit&eacute; n'est applicable qu'&agrave; la newsletter, car c'est le seul type de document susceptible d'&ecirc;tre programm&eacute; pour son envoi &agrave; une liste de distribution.&nbsp;&nbsp;</P>
</FONT><H3>&Eacute;dition de sites Web</H3>
<P>L'&eacute;dition de sites Web partage toutes les op&eacute;rations de l'&eacute;dition de Newsletters, qui sont disponibles pour chacune des pages du site Web. Dans le cas pr&eacute;sent, vous trouverez en outre les options suivantes :</P>
<H4>Cr&eacute;er une nouvelle page</H4>
<P>Pour ajouter une nouvelle page au site Web, cliquez sur l'option Nouvelle Page contenue dans le menu sup&eacute;rieur de l'&eacute;cran &Eacute;dition. Une fen&ecirc;tre sera alors affich&eacute;e, o&ugrave; vous devez pr&eacute;ciser le nom/ l'&eacute;tiquette pour cette page, et ensuite choisir le type de conteneur que vous allez utiliser dans cette page.</P>
<H4>Supprimer la page actuelle</H4>
<P>Cliquez sur l'option &Eacute;liminer Page pour supprimer la page Web que vous &ecirc;tes en train d'&eacute;diter.</P>
<H4>S&eacute;lectionner la page &agrave; &eacute;diter</H4>
<P>Pour changer la page &agrave; &eacute;diter, s&eacute;lectionnez dans la combo-box la page souhait&eacute;e, puis cliquez sur l'option &Eacute;diter Page.</P>
<H4>Page de ressources partag&eacute;es</H4>
<P>Les sites Web peuvent inclure une page de ressources partag&eacute;es. Il s'agit d'un regroupeur de ressources qui peuvent &ecirc;tre r&eacute;f&eacute;renci&eacute;es depuis toutes les pages de votre site Web. Vous pouvez ajouter ou &eacute;liminer des ressources partag&eacute;es en s&eacute;lectionnant la page pertinente dans la combo-box et en cliquant ensuite sur l'option &Eacute;diter Page.</P>
<FONT FACE="Wingdings" SIZE=5><P>F</FONT>Cette page se diff&eacute;rencie des autres surtout parce qu'elle n'est pas visible directement depuis le site Web. Elle n'est visible qu'en mode &eacute;dition et permet d'&eacute;diter le menu d'&eacute;tiquettes de navigation du site Web. Pour ajouter de nouvelles &eacute;tiquettes, vous devez &eacute;diter dans le Panneau de Contr&ocirc;le le bloc d'information Menu. Vous pouvez ajouter de nouveaux &eacute;l&eacute;ments de menu et attribuer des liens hypertexte aux pages du site Web.</P>
<H2>Programmer un envoi de newsletter</H2>
<P>En cliquant avec le bouton droit de la souris sur une newsletter dans la liste principale, l'option Programmer Envoi est affich&eacute;e. Ceci ouvre une nouvelle fen&ecirc;tre o&ugrave; vous suivrez les pas suivants pour programmer votre e-mailing :&nbsp;</P>
<OL>

<LI>Tout d'abord, choisissez la liste de distribution &agrave; laquelle la newsletter sera adress&eacute;e.</LI>
<LI>Ensuite, confirmez la newsletter et la liste des destinataires. Un r&eacute;sum&eacute; de l'op&eacute;ration d'envoi programm&eacute;e sera affich&eacute;, o&ugrave; vous pouvez taper une description, pr&eacute;ciser la date d'envoi souhait&eacute;e, indiquer si vous voulez inclure les images dans le message ou les laisser sous la forme de liens absolus.</LI></OL>

<FONT FACE="Wingdings" SIZE=5><P>F</FONT>Apr&egrave;s avoir cliqu&eacute; sur Terminer dans la fen&ecirc;tre Programmer Envoi, la newsletter est r&eacute;g&eacute;n&eacute;r&eacute;e et la demande d'envoi est mise en file d'attente. Vous pouvez visualiser la newsletter r&eacute;sultante, soit en &eacute;ditant cette t&acirc;che dans l'&eacute;cran T&acirc;ches programm&eacute;es et cliquant ensuite sur le Document &agrave; Envoyer, soit depuis la liste de documents, en s&eacute;lectionnant Pr&eacute;-visualisation dans le menu flottant du document Newsletter.</P>
<P><HR></P>
<P>&nbsp;</P></BODY>
</HTML>
